<template>
  <section>
    <h1>Invincible</h1>
    <img
      src="https://avatars.mds.yandex.net/i?id=13ce99865de66b398adffe06b4e523b1_l-4404575-images-thumbs&n=13"
    />
    <p>
      Маркус Себастьян «Марк» Грейсон — главный герой серии «Invincible».
      Гибрид вилтрумита и человека, супергерой, известный как «Непобедимый», сын
      Нолана Грейсона/Омни-Мэна и Дебби Грейсон, сводный старший брат Оливера
      Грейсона по отцовской линии и внук Оливера по материнской. Он также
      является бойфрендом Евы Уилкинс/Атомной Евы и отцом ее будущего ребенка. В 17
      лет Марк обрёл свои суперспособности и начал путь супергероя под
      руководством отца. После недолгого сотрудничества с «Юной командой» он
      объединился с Атом Ив и в конце концов признался ей в своих чувствах,
      положив начало их крепкой любви. Он также объединился со вторым составом
      «Стражей Галактики» и Сесилом Стедманом из Агентства глобальной обороны,
      чтобы защищать Землю от самых разных угроз. По мере того как круг его
      обязанностей расширялся, Марк взял на себя ответственность за
      противостояние надвигающейся угрозе со стороны Империи Вилтрум, стремясь
      защитить не только Землю, но и всю галактику. После Непобедимой войны и
      первого столкновения с Завоевателями Марк начал испытывать сильнейший
      «военный мандраж», особенно с тех пор, как стал придерживаться более
      утилитарного подхода к защите тех, кого любит, от опасности, что он
      продемонстрировал, когда помог уничтожитьВильтрам в разгар Вильтрамитской
      войны. По окончании войны Непобедимый вернулся на Землю, где узнал, что
      витрумские беженцы переселились на его планету, чтобы скрещиваться с
      местными и восстановить численность населения Империи. Это привело к
      непростому перемирию с Траггом.
    </p>
  </section>
</template>

<style scoped>
section {
  display: flex;
  flex-direction: column;
  align-items: center;
}
h1 {
  font-size: 40px;
}
img {
  border-radius: 16px;
  margin: 40px 0;
  width: 1000px; 
}
p {
  font-size: 25px;
  text-align: justify;
}
</style>
