<script setup>
import CardSeasons from "@/components/cardSeasons.vue";

import { onMounted, ref } from "vue";
let cards = ref([
  {
    img: "https://avatars.mds.yandex.net/i?id=00b058611b74f7555acfabc3485205e9_l-5336870-images-thumbs&n=13",
    title: "Invincible Season 1",
    desc: "Семнадцатилетний Марк Грейсон, сын могущественного супергероя Нолана (Всечеловека), наконец наследует сверхспособности и начинает свой путь героя. Марк пытается совмещать обычную подростковую жизнь — школу, романтические отношения и дружбу — с обязанностями супергероя. По мере развития сюжета он участвует в разных миссиях: спасает гору Рашмор, отправляется на другую планету и сражается со злодеями. Шокирующим поворотом становится раскрытие истинной природы Нолана: он — представитель расы завоевателей с планеты Вилтрум и уничтожает команду Стражей Земного шара. В финале сезона Марк противостоит отцу, отвергая его планы по захвату Земли; после тяжёлой битвы Нолан покидает планету, а Марк твёрдо решает защищать человечество"
  },
  {
    img: "https://avatars.mds.yandex.net/i?id=8c5732c2d9854533a226b44c8b830368_l-9589172-images-thumbs&n=13&n=13&w=230&h=290",
    title: "Invincible Season 2",
    desc: "Второй сезон «Непобедимого» — продолжение истории Марка, который пытается пережить предательство отца и продолжает защищать мир от злодеев. Главный злодей — Энгстром Леви, способный открывать порталы между мирами. Марк ищет способы развиваться не только как супергерой, но и как человек. Супергерой вместе со своей девушкой поступает в колледж и покидает дом в поисках новой жизни. Марк всё ещё не отошёл от трагедии с Омни-Мэном, поэтому ему всё ещё эмоционально тяжело. В новом сезоне развиваются отношения Марка и Эмбер, а также прогресс взаимодействия «Непобедимого» с другими обитателями космоса. ",
  },
  {
    img: "https://avatars.mds.yandex.net/i?id=8e005c083e6fbcfe425af697854fe4c5_l-4987479-images-thumbs&n=13&n=13&w=230&h=290",
    title: "Invincible Season 3",
    desc: "Третий сезон мультсериала «Неуязвимый» продолжает линию ответственности Марка за действия отца и вилтрумитов, добавляет новый контекст. Марк сталкивается с неожиданным следствием своих действий, чувствует новый уровень ответственности. Герой начинает раскрывать несовершенства окружающих и агентства, задаётся вопросами экзистенциального характера. Сесил хочет управлять супергероями и не считается с мнением Марка и Защитников планеты. Финальный эпизод сезона посвящён битве Неуязвимого и его близких с прибывшим на Землю вильтрумитом Конквестом.",
  },
]);
</script>

<template>
  <section>
    <CardSeasons v-for="(card, i) in cards" :key="i" :card="card" />
  </section>
</template>
<style scoped>
section {
  display: grid;
  gap: 40px;
}
</style>
